/* Magic Mirror Config
 *
 * By Michael Teeuw http://michaelteeuw.nl
 * MIT Licensed.
 *
 * For more information how you can configurate this file
 * See https://github.com/MichMich/MagicMirror#configuration
 *
 */

var config = {
	address: "0.0.0.0",
	port: 2020,
	ipWhitelist: [],

	language: "el",
	locale: "el-GR",
	logLevel: ["INFO", "LOG", "WARN", "ERROR"], // Add "DEBUG" for even more logging
	timeFormat: 24,
	units: "metric",

	modules: [

		{
			module: "alert",
		},
		{
			 module: "MMM-Wallpaper",
			 position: "fullscreen_below",
			 config: {
				 source: "bing",
			 	 maximumEntries: "1",
				 }
		},

		{
			module: "updatenotification",
			position: "top_bar"
		},
		{
			module: "clock",
			position: "top_left"
		},
		{
			module: "calendar",
			position: "top_left",
		},
		{
			module: "currentweather",
			position: "bottom_left",
			config: {
				location: "Ιεράπετρα",
				locationID: "261814",
				appendLocationNameToHeader: false,
				appid: "72e0593f5641e620b4b8da4acd9bc074",
				showFeelsLike: true,
				showHumidity: true,
				lang: "el",
				roundTemp: true,
				windUnits: "kmh",
				updateInterval: 300000,
			}
		},
    {
		    module: "weatherforecast",
		    position: "bottom_right",
		    config: {
 				 appendLocationNameToHeader: false,
			   location: "Ιεράπετρα",
			   locationID: "261814",
			   appid: "72e0593f5641e620b4b8da4acd9bc074",
			   units: "metric",
			   maxNumberOfDays: 7,
			   updateInterval: 300000,
		}
	    },
			{
				module: "newsfeed",
				position: "lower_third",
				config: {
					feeds: [
/*						{
										title: "News.gr Ροή Ειδήσεων",
										url: "https://www.news.gr/rss.ashx",
										encoding: "UTF-8" //ISO-8859-1
						},
*/
						{
										title: "News.gr Σημαντικές Eιδήσεις",
										url: "http://www.news.gr/rss.ashx?colid=2",
										encoding: "UTF-8" //ISO-8859-1
						},
						{
										title: "News.gr Ελλάδα",
										url: "http://www.news.gr/rss.ashx?colid=7",
										encoding: "UTF-8" //ISO-8859-1
						},
						{
										title: "News.gr Κόσμος",
										url: "http://www.news.gr/rss.ashx?colid=10",
										encoding: "UTF-8" //ISO-8859-1
						},
						{
										title: "News.gr Tech",
										url: "http://www.news.gr/rss.ashx?colid=12",
										encoding: "UTF-8" //ISO-8859-1
						},
					],
					showSourceTitle: false,
					wrapTitle: true,
					showPublishDate: false,
					broadcastNewsFeeds: true,
					broadcastNewsUpdates: true,
					hideLoading: true,
					showDescription: true,
					wrapDescription: true,
					ignoreOldItems: true,
					removeEndTags: "both",
					removeStartTag:"both",
					startTags: ['Δείτε','-','Βιντεο','Εικόνες','- Δείτε εικόνες','- Δείτε βίντεο'],
					endTags: ['Δείτε','-','Βιντεο','Εικόνες','- Δείτε εικόνες','- Δείτε βίντεο'],
				}
			},
		{
      module: "compliments",
      position: "top_center",
      disabled: false,
      config: {
				compliments: {
					anytime: [
						"''Ἕπου θεῷ''\nΑκολούθησε το θεό",
						"''Νόμῳ πείθου''\nΠειθάρχησε το νομο",
						"''Θεούς σέβου''\n\nΣεβάσου τους θεούς",
						"''Γονεῖς αἰδοῦ''\n\nΣεβάσου τους γονείς σου",
						"''Ἡττῶ ὑπέρ δικαίου''\n\nΝα δεχτείς να ηττηθείς από το δίκαιο",
						"''Γνῶθι μαθών''\n\nΑφού λάβεις γνώση, μάθε",
						"''Ἀκούσας νόει''\n\nΑφού ακούσεις, κατανόησε",
						"''Σαυτόν ἴσθι''\n\nΝα είσαι ο εαυτός σου",
						"''Γαμεῖν μέλλε''\n\nΣχεδίαζε να παντρευτείς",
						"''Καιρόν γνῶθι''\n\nΜάθε το σωστό χρόνο για την ευκαιρία σου",
						"''Φρόνει θνητὰ''\n\nΣκέψου ως θνητός",
						"''Ξένος ων ἴσθι''\n\nΑν είσαι ξένος, να ενεργείς όπως αναμένεται από τους ξένους",
						"''Ἑστίαν τίμα''\n\nΤίμα το σπίτι σου",
						"''Άρχε σεαυτοῦ''\n\nΈλεγξε τον εαυτό σου",
						"''Φίλοις βοήθει''\n\nΒοήθα τους φίλους σου",
						"''Θυμοῦ κράτει''\n\nΚράτα το θυμό σου",
						"''Φρόνησιν άσκει''\n\nΆσκησε τη φρόνησή σου",
						"''Πρόνοιαν τίμα''\n\nΤίμα την προνοητικότητα",
						"''Όρκω μη χρω''\n\nΜην χρησιμοποιείς όρκο",
						"''Φιλίαν ἀγάπα''\n\nΑγάπα τη φιλία",
						"''Παιδείας ἀντέχου''\n\nΝα αντέχεις τις δυσκολίες της εκπαίδευσης",
						"''Δόξαν δίωκε''\n\nΕπιδίωξε τη δόξα",
						"''Σοφίαν ζήλου''\n\nΖήλευε τη σοφία",
						"''Καλόν εὖ λέγε''\n\nΝα επαινείς το καλό",
						"''Ψέγε μηδένα''\n\nΜην ψέγεις κανένα (μην κατηγορείς κανένα)",
						"''Ἐπαίνει ἀρετήν''\n\nΕπαίνεσε την αρετή",
						"''Πρᾶττε δίκαια''\n\nΠράξε δίκαια",
						"''Φίλοις εὐνόει''\n\nΕυνόησε τους φίλους σου",
						"''Ἐχθρούς ἀμύνου''\n\nΝα αμύνεσαι ενάντια στους εχθρούς σου",
						"''Εὐγένειαν ἄσκει''\n\nΕξάσκησε την ευγένεια",
						"''Κακίας ἀπέχου''\n\nΝα απέχεις από την κακία",
						"''Κοινός γίνου''\n\nΓίνε κοινωνικός",
						"''Ἴδια φύλαττε''\n\nΝα διαφυλάττεις όσα σου ανήκουν",
						"''Ἀλλοτρίων ἀπέχου''\n\nΝα απέχεις από όσα ανήκουν σε άλλους",
						"''Ἄκουε πάντα''\n\nΆκουγε τα πάντα",
						"''Εὔφημος ἴσθι''\n\nΝα έχεις καλή φήμη",
						"''Φίλῳ χαρίζου''\n\nΚάνε χάρη στο φίλο σου",
						"''Μηδέν ἄγαν''\n\nΜην κάνεις τίποτα σε υπερβολή",
						"''Χρόνου φείδου''\n\nΝα μην ξοδεύεις το χρόνο σου",
						"''Ὅρα τό μέλλον''\n\nΠρόβλεψε το μέλλον",
						"''Ὕβριν μίσει''\n\nΝα μισείς την ύβρη",
						"''Ἱκέτας αἰδοῦ''\n\nΤους ικέτες σεβάσου",
						"''Πᾶσιν ἁρμόζου''\n\nΝα είσαι βολικός με όλους",
						"''Υἱούς παίδευε''\n\nΕκπαίδευε τα παιδιά σου",
						"''Ἔχων χαρίζου''\n\nΑν έχεις, χάριζε",
						"''Δόλον φοβοῦ''\n\nΝα φοβάσαι το δόλο",
						"''Εὐλόγει πάντας''\n\nΜίλα καλά για όλους",
						"''Φιλόσοφος γίνου''\n\nΓίνε φιλόσοφος",
						"''Ὅσια κρῖνε''\n\nΚρίνε όσα είναι όσια",
						"''Γνούς πρᾶττε''\n\nΑν γνωρίζεις, πράξε",
						"''Φόνου ἀπέχου''\n\nΝα απέχεις από φόνους (Μη φονεύεις)",
						"''Εὔχου δυνατά''\n\nΝα προσεύχεσαι για όσα είναι δυνατά",
						"''Σοφοῖς χρῶ''\n\nΣυμβουλεύσου τους σοφούς",
						"''Ἦθος δοκίμαζε''\n\nΔοκίμαζε το ήθος",
						"''Λαβών ἀπόδος''\n\nΑν πάρεις, δώσε",
						"''Ὑφορῶ μηδένα''\n\nΜην υποτιμάς κανένα",
						"''Τέχνῃ χρῶ''\n\nΧρησιμοποίησε τις ικανότητές σου",
						"''Ὃ μέλλεις, δός''\n\nΌτι σχεδιάζεις, κάνε το",
						"''Εὐεργεσίας τίμα''\n\nΤίμα την ευεγερσία",
						"''Φθόνει μηδενί''\n\nΜη φθονείς κανένα",
						"''Φυλακῇ πρόσεχε''\n\nΌταν είσαι σε επιφυλακή, πρόσεχε",
						"''Ἐλπίδα αἴνει''\n\nΕπαίνεσε την ελπίδα",
						"''Διαβολήν μίσει''\n\nΝα μισείς τη διαβολή",
						"''Δικαίως κτῶ''\n\nΝα αποκτάς δίκαια",
						"''Ἀγαθούς τίμα''\n\nΤίμα τους αγαθούς (καλούς)",
						"''Κριτήν γνῶθι''\n\nΓνώριζε τον κριτή",
						"''Γάμους κράτει''\n\nΚράτα (τίμα) τον γάμο σου",
						"''Τύχην νόμιζε''\n\nΑναγνώριζε την τύχη",
						"''Ἐγγύην φεῦγε''\n\nΑπόφευγε τις δεσμεύσεις / υποσχέσεις",
						"''Πᾶσι διαλέγου''\n\nNα συνδιαλέγεσαι με όλους",
						"''Ὁμοίοις χρῶ''\n\nΚάνε παρέα μα τους ομοίους σου",
						"''Δαπανῶν ἄρχου''\n\nΈλεγχε τις δαπάνες σου",
						"''Κτώμενος ἥδου''\n\nΜε αυτά που έχεις αποκτήσει, να ευχαριστιέσαι",
						"''Αἰσχύνην σέβου''\n\nΝα σέβεσαι την ντροπή",
						"''Χάριν ἐκτέλει''\n\nΚάνε χάρη",
						"''Εὐτυχίαν εὔχου''\n\nΝα εύχεσαι ευτυχία",
						"''Τύχην στέργε''\n\nΝα αγαπάς την τύχη",
						"''Ἀκούων ὅρα''\n\nΑφού ακούσεις, δες",
						"''Ἐργάζου κτητά''\n\nΔούλεψε για να αποκτήσεις",
						"''Ἔριν μίσει''\n\nΝα μισείς την έριδα (τους τσακωμούς)",
						"''Ὄνειδος ἔχθαιρε''\n\nΝα εχθρεύεσαι το όνειδος, την ντροπή",
						"''Γλῶτταν ἴσχε''\n\nΝα υπερισχύεις της γλώσσας σου (Κράτα τη γλώσσα σου)",
						"''Ὕβριν ἀμύνου''\n\nΝα αμύνεσαι από τις ύβρεις",
						"''Κρῖνε δίκαια''\n\nΚρίνε δίκαια",
						"''Χρῶ χρήμασιν''\n\nΧρησιμοποίησε όσα έχεις",
						"''Ἀδωροδόκητος δίκαζε''\n\nΔίκαζε χωρίς να δωροδοκηθείς",
						"''Αἰτιῶ παρόντα''\n\nΚατάκρινε κάποιον μόνον αν είναι παρών",
						"''Λέγε εἰδώς''\n\nΑν ξέρεις, λέγε",
						"''Βίας μή ἔχου''\n\nΜην έχεις βία",
						"''Ἀλύπως βίου''\n\nΖήσε χωρίς λύπη",
						"''Ὁμίλει πρᾴως''\n\n	α μιλάς με πράο τρόπο",
						"''Πέρας ἐπιτέλει μή ἀποδειλιῶν''\n\nΦτάσε στο τέλος χωρίς να δειλιάσεις",
						"''Φιλοφρόνει πᾶσιν''\n\nΝα φιλοφρονείς όλους",
						"''Υἱοῖς μή καταρῶ''\n\nΝα μην καταριέσαι τα παιδιά σου",
						"''Γλώττης Γυναικός Άρχε''\n\nΝα συγκρατείς τους λόγους της γυναίκας σου",
						"''Σεαυτόν εὖ ποίει''\n\nΝα κάνεις καλό στον εαυτό σου",
						"''Εὐπροσήγορος γίνου''\n\nΝα είσαι ευγενικός",
						"''Ἀποκρίνου ἐν καιρῷ''\n\nΝα αποκρίνεσαι (να απαντάς) εγκαίρως",
						"''Πόνει μετ' εὐκλείας''\n\nΠροσπάθησε ένδοξα",
						"''Πρᾶττε ἀμετανοήτως''\n\nΠράττε έτσι που να μην μετανοείς",
						"''Ἁμαρτάνων μετανόει''\n\nΑν αμαρτάνεις, να μετανοείς",
						"''Ὀφθαλμοῦ κράτει''\n\nΈλεγξε το τι κοιτά το μάτι σου",
						"''Βουλεύου χρόνῳ''\n\nΑποφάσιζε με σύμβουλο τον χρόνο (εγκαίρως)",
						"''Πρᾶττε συντόμως''\n\nΠράξε σύντομα",
						"''Φιλίαν φύλαττε''\n\nΝα διαφυλάττεις την φιλία",
						"''Εὐγνώμων γίνου''\n\nΝα είσαι ευγνώμων",
						"''Ὁμόνοιαν δίωκε''\n\nΕπιδίωκε την αρμονία",
						"''Ἄρρητον κρύπτε''\n\nΤα μυστικά κρύψε",
						"''Τό κρατοῦν φοβοῦ''\n\nΝα φοβάσαι τους έχοντες έξουσία",
						"''Τό συμφέρον θηρῶ''\n\nΚυνήγα το συμφέρον σου",
						"''Καιρόν προσδέχου''\n\nΝα αποδέχεσαι το κατάλληλο μέτρο",
						"''Ἔχθρας διάλυε''\n\nΔιάλυε τις έχθρες",
						"''Γῆρας προσδέχου''\n\nΑποδέξου τα γηρατειά",
						"''Ἐπί ῥώμῃ μή καυχῶ''\n\nΌταν είσαι δυνατός μην καυχιέσαι",
						"''Εὐφημίαν ἄσκει''\n\nΝα εξασκείς την καλή φήμη",
						"''Ἀπέχθειαν φεῦγε''\n\nΑπόφευγε την απέχθεια",
						"''Πλούτει δικαίως''\n\nΑπόκτησε πλούτη με δίκαιο τρόπο",
						"''Δόξαν μή λεῖπε''\n\nΜην εγκαταλείπεις τη δόξα",
						"''Κακίαν μίσει''\n\nΝα μισείς την κακία",
						"''Κινδύνευε φρονίμως''\n\nΚινδύνευε φρονίμως",
						"''Μανθάνων μή κάμνε''\n\nΜην κουράζεσαι να μαθαίνεις",
						"''Φειδόμενος μή λεῖπε''\n\nΝα μην σου λείπει η οικονομία",
						"''Χρησμούς θαύμαζε''\n\nΘαύμαζε τους χρησμούς",
						"''Οὕς τρέφεις, ἀγάπα''\n\nΑγάπα αυτούς που θρέφεις",
						"''Ἀπόντι μή μάχου''\n\nΝα μην αντιμάχεσαι τους απόντες",
						"''Πρεσβύτερον αἰδοῦ''\n\nΝα σέβεσαι τους μεγαλύτερους",
						"''Νεώτερον δίδασκε''\n\nΔίδασκε τους νεώτερους",
						"''Πλούτῳ ἀπίστει''\n\nΜην εμπιστεύεσαι τον πλούτο",
						"''Σεαυτόν αἰδοῦ''\n\nΝα σέβεσαι τον εαυτό σου",
						"''Μή ἄρχε ὑβρίζειν''\n\nΜην αρχίζεις να γίνεσαι αυθάδης",
						"''Προγόνους στεφάνου''\n\nΣτεφάνωσε τους προγόνους σου",
						"''Θνῆσκε ὑπέρ πατρίδος''\n\nΠέθανε για την πατρίδα σου",
						"''Τῷ βίῳ μή ἄχθου''\n\nΜη βαρυγκομάς τη ζωή",
						"''Ἐπί νεκρῷ μή γέλα''\n\nΜη γελάς για τους νεκρούς",
						"''Ἀτυχοῦντι συνάχθου''\n\nΜε όποιον ατύχησε μοιράσου το φορτίο του",
						"''Χαρίζου ἀβλαβῶς''\n\nΧάριζε χωρίς να βλάπτεις",
						"''Μὴ ἐπί παντί λυποῦ''\n\nΜη λυπάσαι για τα πάντα",
						"''Ἐξ εὐγενῶν γέννα	''\n\nΝα δημιουργείς από καλής προέλευσης στοιχεία",
						"''Ἐπαγγέλλου μηδενί''\n\nΜην υπόσχεσαι σε κανέναν",
						"''Φθιμένους μή ἀδίκει''\n\nΜην αδικείς τους πεθαμένους",
						"''Εὖ πάσχε ὡς θνητός''\n\nΝα περνάς καλά σαν θνητός",
						"''Τύχῃ μή πίστευε''\n\nΜην πιστεύεις στην τύχη",
						"''Παῖς ὤν κόσμιος ἴσθι''\n\nΩς παιδί να είσαι ευγενικός",
						"''Ἡβῶν ἐγκρατής''\n\nΩς νέος, να είσαι εγκρατής",
						"''Μέσος δίκαιος''\n\nΩς μεσήλικας να είσαι δίκαιος",
						"''Πρεσβύτης εὔλογος''\n\nΩς μεγάλος να δίνεις σωστές συμβουλές",
						"''Τελευτῶν ἄλυπος''\n\nΌταν πεθαίνεις, να μη λυπηθείς"

					]
				},
        updateInterval: 20000,
        classes: "delphy",
        fadeSpeed: 2000,
      },
    },
		{
	module: 'MMM-Worldclock',
	disabled: false,
	position: 'top_left', // This can be any of the regions, best in top_left or top_right regions
	config: {
	// See 'Configuration options' for more information.
		timeFormat: 'hh:mm A',
		style: 'top', // 'top', 'left','right','bottom'
		offsetTimezone: null,
		clocks: [
			{
				title: " ", // Too long of a title could cause bad text align.
				timezone: "Europe/London", //When omitted, Local time will be displayed.
				timeFormat: "HH:mm",
				flag: "gb", // If you'd like a flag from the standard library
			},
			{
				title: " ",
				timezone: "Europe/Berlin",
				timeFormat: "HH:mm", // Time format override.
				flag: "de" // if you'd like a flag from a file on your mirror device.
			},
		]
	},
},
		{
			module: "MMM-MoonPhase",
			position: "top_right",
			config: {
				updateInterval: 43200000,
				hemisphere: "N",
				resolution: "detailed",
				title: false,
				phase: true,
				x: 80,
				y: 80,
				age: true,
				alpha: 0.5
						}
					},
    {
                        module: 'MMM-Remote-Control'
                },

]
};

/*************** DO NOT EDIT THE LINE BELOW ***************/
if (typeof module !== "undefined") {module.exports = config;}
